views/layouts/main.php

SELECT * FROM `admin` WHERE `id`=1
---

AppAsset::register($this);

$admin = Admin::findOne(Yii::$app->user->id);