controllers/BusinessController.php

    public function actionSetup() {
        /* @var $admin Admin */
        $admin = Admin::findOne(Yii::$app->user->id);
        /* @var $model Business */
        $model = Business::findOne($admin->business_id);
---
SELECT * FROM `admin` WHERE `id`=1
SELECT * FROM `business` WHERE `id`=1

    public function actionProfile() {
        /* @var $admin Admin */
        $admin = Admin::findOne(Yii::$app->user->id);
        /* @var $model Business */
        $model = Business::findOne($admin->business_id);

        if ($model->load(Yii::$app->request->post())) {
---
SELECT * FROM `admin` WHERE `id`=1
SELECT * FROM `business` WHERE `id`=1

    public function actionScene() {
        /* @var $admin Admin */
        $admin = Admin::findOne(Yii::$app->user->id);

        // 门面
        $frontImages = BusinessScene::find()
            ->where([
                'business_id' => $admin->business_id,
                'type' => 1
            ])
            ->orderBy(['rank' => 'asc'])
            ->all();
        // 大厅
        $foyerImages = BusinessScene::find()
            ->where([
                'business_id' => $admin->business_id,
                'type' => 2
            ])
            ->orderBy(['rank' => 'asc'])
            ->all();
        // 后厨
        $kitchenImages = BusinessScene::find()
            ->where([
                'business_id' => $admin->business_id,
                'type' => 3
            ])
            ->orderBy(['rank' => 'asc'])
            ->all();
---
SELECT * FROM `admin` WHERE `id`=1
SELECT * FROM `business_scene` WHERE (`business_id`=1) AND (`type`=1) ORDER BY `rank`