controllers/SiteController.php

SELECT COUNT(*) FROM `order` WHERE (`created_at` >= 1470355200) AND (`created_at` <= 1470441599)
SELECT COUNT(*) FROM `user` WHERE (`created_at` >= 1470355200) AND (`created_at` <= 1470441599)
SELECT sum(total_price) AS volume, count(*) AS count FROM `order` WHERE (`created_at` >= 1470355200) AND (`created_at` <= 1470441599)
---
    public function actionIndex() {
        $last15days         = [];
        $last6Month         = [];
        $numDataOrder       = []; // 订单生成数据
        $numDataUser        = []; // 用户注册数据
        $numDataVolume      = []; // 营业额数据
        $numDataCompleted   = []; // 订单完成数据
        $numDataVolumeMonth = []; // 每月营业额

        $today = strtotime("00:00:00");
        $todayEnd = strtotime("23:59:59");
        for ($i = 0; $i < 15; $i++) {
            $timestrap = strtotime('-' . $i . ' days', $today);
            $timestrapEnd = strtotime('-' . $i . ' days', $todayEnd);
            $where = [
                'and',
                ['>=', 'created_at', $timestrap],
                ['<=', 'created_at', $timestrapEnd]
            ];
            array_unshift($last15days, date('m/d', $timestrap));
            array_unshift($numDataOrder, Order::find()->where($where)->count());
            array_unshift($numDataUser, User::find()->where($where)->count());

            $data = Order::find()->select(['sum(total_price) AS volume', 'count(*) AS count'])
                ->where($where)
                ->asArray()
                ->one();

SELECT SUM(total_price) FROM `order` WHERE (`created_at` >= 1470009600) AND (`created_at` <= 1472687999)
SELECT sum(total_price) AS volume, count(*) AS count FROM `order`
---
                ['<=', 'created_at', $timestrapEnd]
            ];
            array_unshift($last6Month, date('Y/m', $timestrap));
            array_unshift($numDataVolumeMonth, Order::find()->where($where)->sum('total_price'));
        }

        $data2 = Order::find()->select(['sum(total_price) AS volume', 'count(*) AS count'])
            ->asArray()
            ->one();

SELECT COUNT(*) FROM `order`
SELECT COUNT(*) FROM `user`
---
            'numDataVolume' => $numDataVolume,
            'numDataCompleted' => $numDataCompleted,
            'numDataVolumeMonth' => $numDataVolumeMonth,
            'countOrder' => Order::find()->count(),
            'countCompleted' => $data2['count'],
            'sumVolume' => $data2['volume'] ?: '0.00',
            'countUser' => User::find()->count(),