controllers/UserController.php

    public function actionProfile() {
        /* @var $model Admin */
        $model = Admin::findOne(Yii::$app->user->id);
---
SELECT * FROM `admin` WHERE `id`=1