models/Admin.php

SELECT * FROM `admin` WHERE (`id`=1) AND (`status`='active')
---
    public static function findIdentity($id) {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);