models/Category.php

    public static function getKeyValuePairs() {
        /* @var $admin Admin */
        $admin = Admin::findOne(Yii::$app->user->id);
---
SELECT * FROM `admin` WHERE `id`=1