models/CategorySearch.php

    public function search($params) {
        /* @var $admin Admin */
        $admin = Admin::findOne(Yii::$app->user->id);
---
SELECT * FROM `admin` WHERE `id`=1