models/ProductSearch.php

SELECT * FROM `admin` WHERE `id`=1
---
    public function search($params) {
        /** @var $admin Admin */
        $admin = Admin::findOne(Yii::$app->user->id);