models/SendChangePhoneSmsForm.php

    public function rules() {
        return [
            ['phone', 'trim'],
            ['phone', 'required'],
            ['phone', 'match', 'pattern' => '/^1[3|5|7|8|][0-9]{9}$/'],
            // 验证手机号是否存在
            ['phone', function ($attribute, $params) {
                $admin = Admin::findOne(['phone' => $this->phone]);
---
SELECT * FROM `admin` WHERE `phone`='17721429141'